{
    "catalog": [
        {
            "name": "Тарталетка 'Зеленое яблоко'",
            "description": "Тарталетка с яблочным муссом, компоте из зелёных яблок и фисташковым бисквитом пропитанным соком юдзу",
            "badgeList": ["Популярный десерт"],
            "img": "image-1.jpg"
        },
        {
            "name": "Пирожное 'Три Шоколада'",
            "description": "Пирожное состоящее из слоёв шоколадного мусса с шоколадным бисквитом дакуаз на хрустящем кранче из тёмного шоколада с орехом пекан. Покрывается чёрной глазурью.",
            "badgeList": ["Популярный десерт","Пониженное содержание сахара"],
            "img": "image-2.jpg"
        },
        {
            "name": "Торт 'Инжир-клубника-малина'",
            "description": "Мусс из садового инжира с компоте из клубники, малиновым конфитюром, на безглютеновом бисквите и кокосовым крамблом, покрытые малиновой глазурью.\n* в основе этого десерта фрукты и ягоды, которые мы вырастили для Вас в собственных садах, в городе Сочи.",
            "badgeList": ["Популярный десерт","Из нашего сада", "Без глютена"],
            "img": "image-3.jpg"
        }
    ],
    "about": [
        {
            "name": "about-1",
            "heading": "Качественные и вкусные продукты",
            "description": "При производстве в Сочи у нас также есть собственный сад, в котором растут инжир, хурма, яблоки, груши и фундук, например, мы сушим яблоки и груши, замораживаем свежий инжир, замораживаем и вялим спелую хурму. Мы отбираем самые спелые ягоды и фрукты сада и привозим в Петербург в специальных рефрижераторах (морозильные установки), которые позволят в целости доставить продукт, чтоб они стали главным ингредиентом в наших десертах.",
            "img": "icon-1"
        },
        {
            "name": "about-2",
            "heading": "Вкус и польза",
            "description": "«Сахара нет» — это баланс вкуса и пользы, который мы соблюдаем за счёт употребления минимального количества сахара или полного исключения его из рецепта, а так же за счёт уменьшения калорийности, путём замены продуктов на более легкие, натуральные и полезные. В нашем меню вы найдете веганские, сыроедческие, фитнес десерты, а так же десерты без сахара и глютена.",
            "img": "icon-2"
        },
        {
            "name": "about-3",
            "heading": "Красивые десерты",
            "description": "Десерты должны вызывать весь спектр удовольствий и мы делаем все, чтобы они получались красивыми. ",
            "img": "icon-3"
        }
    ]
}